docs/java8.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-01-09 Mon 04:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java 8 in Action</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Eric Bailey">
<meta name="description" content="Notes as I read the Java 8 Manning book."
>
<meta name="keywords" content="notes, Java, Java 8, functional programming">
<link rel="stylesheet" type="text/css" href="css/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Java 8 in Action</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org511b9bd">Chapter 1</a>
<ul>
<li><a href="#orgb57538c">Filtering Apples Outline</a></li>
<li><a href="#orgd9b99a4">Apple Class</a>
<ul>
<li><a href="#orge6952b2">Properties</a></li>
<li><a href="#orgdcef512">Methods</a></li>
</ul>
</li>
<li><a href="#org8328d33">Filtering Methods</a>
<ul>
<li><a href="#org9aeba95">Filter Green Apples</a></li>
<li><a href="#org36861fb">Filter Heavy Apples</a></li>
<li><a href="#org4f412e4">Generic Apple Filter</a></li>
</ul>
</li>
<li><a href="#org5b24242">Predicates</a></li>
<li><a href="#orgb31140d">Main</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org511b9bd" class="outline-2">
<h2 id="org511b9bd">Chapter 1</h2>
<div class="outline-text-2" id="text-org511b9bd">
<p>
<a href="https://github.com/java8/Java8InAction/blob/master/src/main/java/lambdasinaction/chap1/FilteringApples.java">Link</a>
</p>
</div>

<div id="outline-container-orgb57538c" class="outline-3">
<h3 id="orgb57538c">Filtering Apples Outline</h3>
<div class="outline-text-3" id="text-orgb57538c">
<div class="org-src-container">
<pre class="src src-java">&lt;&lt;name <span style="color: #66D9EF;">the</span> <span style="color: #F92672;">package</span>&gt;&gt;

&lt;&lt;imports&gt;&gt;

<span style="color: #F92672;">public</span> <span style="color: #F92672;">class</span> FilteringApples {

    &lt;&lt;main&gt;&gt;

    &lt;&lt;filter <span style="color: #66D9EF;">green</span> <span style="color: #FD971F;">apples</span>&gt;&gt;

    &lt;&lt;filter <span style="color: #66D9EF;">heavy</span> <span style="color: #FD971F;">apples</span>&gt;&gt;

    &lt;&lt;is <span style="color: #66D9EF;">green</span> <span style="color: #FD971F;">apple</span>?&gt;&gt;

    &lt;&lt;is <span style="color: #66D9EF;">heavy</span> <span style="color: #FD971F;">apple</span>?&gt;&gt;

    &lt;&lt;generic <span style="color: #66D9EF;">apples</span> <span style="color: #FD971F;">filter</span>&gt;&gt;

    &lt;&lt;<span style="color: #66D9EF;">Apple</span>&gt;&gt;

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9b99a4" class="outline-3">
<h3 id="orgd9b99a4">Apple Class</h3>
<div class="outline-text-3" id="text-orgd9b99a4">
<div class="org-src-container">
<pre class="src src-java" id="orgc52090d"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Apple</span> {
    &lt;&lt;<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">properties</span>&gt;&gt;

    &lt;&lt;<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">constructor</span>&gt;&gt;

    &lt;&lt;Apple <span style="color: #66D9EF;">weight</span> <span style="color: #FD971F;">getter</span>&gt;&gt;

    &lt;&lt;Apple <span style="color: #66D9EF;">weight</span> <span style="color: #FD971F;">setter</span>&gt;&gt;

    &lt;&lt;Apple <span style="color: #66D9EF;">color</span> <span style="color: #FD971F;">getter</span>&gt;&gt;

    &lt;&lt;Apple <span style="color: #66D9EF;">color</span> <span style="color: #FD971F;">setter</span>&gt;&gt;

    &lt;&lt;Apple <span style="color: #66D9EF;">pretty</span> <span style="color: #FD971F;">printer</span>&gt;&gt;
}
</pre>
</div>
</div>

<div id="outline-container-orge6952b2" class="outline-4">
<h4 id="orge6952b2">Properties</h4>
<div class="outline-text-4" id="text-orge6952b2">
<p>
An <a href="#org4e19f62"><code>Apple</code></a> has two properties, <a href="#org7c8b452"><code>weight</code></a> and <a href="#org4e19f62"><code>color</code></a>,
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgaf4d161">&lt;&lt;<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">weight</span>&gt;&gt;
&lt;&lt;<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">color</span>&gt;&gt;
</pre>
</div>

<p>
where the <a href="#org7c8b452">weight</a> is an <code>int</code> with the default value <code>0</code>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="org7c8b452"><span style="color: #F92672;">private</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">weight</span> = 0;
</pre>
</div>

<p>
and the <a href="#org9ebd824"><code>color</code></a> is a <code>String</code> with the default value <code>""</code>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="org9ebd824"><span style="color: #F92672;">private</span> <span style="color: #66D9EF;">String</span> <span style="color: #FD971F;">color</span> = <span style="color: #E6DB74;">""</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdcef512" class="outline-4">
<h4 id="orgdcef512">Methods</h4>
<div class="outline-text-4" id="text-orgdcef512">
<p>
Given a <a href="#org7c8b452"><code>weight</code></a> and a <a href="#org9ebd824"><code>color</code></a>, construct an <a href="#orgc52090d"><code>Apple</code></a>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgfcab7ca"><span style="color: #F92672;">public</span> <span style="color: #A6E22E;">Apple</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">weight</span>, <span style="color: #66D9EF;">String</span> <span style="color: #FD971F;">color</span>) {
    <span style="color: #F92672;">this</span>.weight = weight;
    <span style="color: #F92672;">this</span>.color = color;
}
</pre>
</div>
</div>

<ul class="org-ul"><li><a id="org7775746"></a>Getters<br ><div class="outline-text-5" id="text-org7775746">
<p>
Get the <a href="#org7c8b452"><code>weight</code></a> of an <a href="#orgc52090d"><code>Apple</code></a>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="org38d8790"><span style="color: #F92672;">public</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #A6E22E;">getWeight</span>() {
    <span style="color: #F92672;">return</span> weight;
}
</pre>
</div>

<p>
Get the <a href="#org9ebd824"><code>color</code></a> of an <a href="#orgc52090d"><code>Apple</code></a>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="org03a87e6"><span style="color: #F92672;">public</span> <span style="color: #66D9EF;">String</span> <span style="color: #A6E22E;">getColor</span>() {
    <span style="color: #F92672;">return</span> color;
}
</pre>
</div>
</div></li>

<li><a id="org16bcf7a"></a>Setters<br ><div class="outline-text-5" id="text-org16bcf7a">
<p>
Set an <a href="#orgc52090d"><code>Apple</code></a>'s <a href="#org7c8b452"><code>weight</code></a>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgcb8da80"><span style="color: #F92672;">public</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">setWeight</span>(<span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">weight</span>) {
    <span style="color: #F92672;">this</span>.weight = weight;
}
</pre>
</div>

<p>
Set an <a href="#orgc52090d"><code>Apple</code></a>'s <a href="#org9ebd824"><code>color</code></a>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="org4e19f62"><span style="color: #F92672;">public</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">setColor</span>(<span style="color: #66D9EF;">String</span> <span style="color: #FD971F;">color</span>) {
    <span style="color: #F92672;">this</span>.color = color;
}
</pre>
</div>
</div></li>

<li><a id="org932ff50"></a>Pretty Printer<br ><div class="outline-text-5" id="text-org932ff50">
<div class="org-src-container">
<pre class="src src-java" id="orgfd497fd"><span style="color: #F92672;">public</span> <span style="color: #66D9EF;">String</span> <span style="color: #A6E22E;">toString</span>() {
    <span style="color: #F92672;">return</span> <span style="color: #E6DB74;">"Apple{"</span> +
           <span style="color: #E6DB74;">"color='"</span> + color + <span style="color: #E6DB74;">'\''</span> +
           <span style="color: #E6DB74;">", weight="</span> + weight +
           <span style="color: #E6DB74;">'}'</span>;
}
</pre>
</div>
</div></li></ul>
</div>
</div>

<div id="outline-container-org8328d33" class="outline-3">
<h3 id="org8328d33">Filtering Methods</h3>
<div class="outline-text-3" id="text-org8328d33">
<p>
We're going to need build lists of <a href="#orgc52090d"><code>Apple</code></a>s here, so we'll start with the empty
list as the <code>result</code>:
</p>
<div class="org-src-container">
<pre class="src src-java" id="org9f8c28c"><span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">result</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">ArrayList</span>&lt;&gt;();
</pre>
</div>

<p>
so we can collect <a href="#orgc52090d">=apple=s</a> matching some predicate:
</p>
<div class="org-src-container">
<pre class="src src-java" id="org22a1d79">result.add(apple);
</pre>
</div>

<p>
Speaking of which, we can check if an <a href="#orgc52090d"><code>apple</code></a> is green:
</p>
<div class="org-src-container">
<pre class="src src-java" id="org7c223d4"><span style="color: #E6DB74;">"green"</span>.equals(apple.getColor())
</pre>
</div>

<p>
or check if it's <i>heavy</i>, meaning its <a href="#org7c8b452"><code>weight</code></a> is greater than <code>150</code>:
</p>
<div class="org-src-container">
<pre class="src src-java" id="orgec59f2c">apple.getWeight() &gt; 150
</pre>
</div>
</div>

<div id="outline-container-org9aeba95" class="outline-4">
<h4 id="org9aeba95">Filter Green Apples</h4>
<div class="outline-text-4" id="text-org9aeba95">
<div class="org-src-container">
<pre class="src src-java" id="orgbb8fe12"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #A6E22E;">filterGreenApples</span>(<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">inventory</span>) {
    &lt;&lt;initialize result as the <span style="color: #66D9EF;">empty</span> <span style="color: #FD971F;">ArrayList</span>&gt;&gt;
    &lt;&lt;collect the green <span style="color: #66D9EF;">apples</span> <span style="color: #FD971F;">iteratively</span>&gt;&gt;
    <span style="color: #F92672;">return</span> result;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org71d601a"><span style="color: #F92672;">for</span> (<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">apple</span>: inventory) {
    <span style="color: #F92672;">if</span> (&lt;&lt;<span style="color: #66D9EF;">green</span> <span style="color: #FD971F;">apple</span>?&gt;&gt;) {
        &lt;&lt;add apple <span style="color: #66D9EF;">to</span> <span style="color: #FD971F;">result</span>&gt;&gt;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org36861fb" class="outline-4">
<h4 id="org36861fb">Filter Heavy Apples</h4>
<div class="outline-text-4" id="text-org36861fb">
<div class="org-src-container">
<pre class="src src-java" id="org8fc3eea"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #A6E22E;">filterHeavyApples</span>(<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">inventory</span>) {
    &lt;&lt;initialize result as the <span style="color: #66D9EF;">empty</span> <span style="color: #FD971F;">ArrayList</span>&gt;&gt;
    &lt;&lt;collect the heavy <span style="color: #66D9EF;">apples</span> <span style="color: #FD971F;">iteratively</span>&gt;&gt;
    <span style="color: #F92672;">return</span> result;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orgfb46a0c"><span style="color: #F92672;">for</span> (<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">apple</span>: inventory) {
    <span style="color: #F92672;">if</span> (&lt;&lt;<span style="color: #66D9EF;">heavy</span> <span style="color: #FD971F;">apple</span>?&gt;&gt;) {
        &lt;&lt;add apple <span style="color: #66D9EF;">to</span> <span style="color: #FD971F;">result</span>&gt;&gt;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f412e4" class="outline-4">
<h4 id="org4f412e4">Generic Apple Filter</h4>
<div class="outline-text-4" id="text-org4f412e4">
<div class="org-src-container">
<pre class="src src-java" id="orge0a5fea"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #A6E22E;">filterApples</span>(<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">inventory</span>, <span style="color: #66D9EF;">Predicate</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">pred</span>) {
    &lt;&lt;initialize result as the <span style="color: #66D9EF;">empty</span> <span style="color: #FD971F;">ArrayList</span>&gt;&gt;
    <span style="color: #F92672;">for</span> (<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">apple</span>: inventory) {
        <span style="color: #F92672;">if</span> (pred.test(apple)) {
            &lt;&lt;add apple <span style="color: #66D9EF;">to</span> <span style="color: #FD971F;">result</span>&gt;&gt;
        }
    }
    <span style="color: #F92672;">return</span> result;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b24242" class="outline-3">
<h3 id="org5b24242">Predicates</h3>
<div class="outline-text-3" id="text-org5b24242">
<div class="org-src-container">
<pre class="src src-java" id="orgbb2c9ce"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">boolean</span> <span style="color: #A6E22E;">isGreenApple</span>(<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">apple</span>) {
    <span style="color: #F92672;">return</span> &lt;&lt;<span style="color: #66D9EF;">green</span> <span style="color: #FD971F;">apple</span>?&gt;&gt;;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orgf20456b"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">boolean</span> <span style="color: #A6E22E;">isHeavyApple</span>(<span style="color: #66D9EF;">Apple</span> <span style="color: #FD971F;">apple</span>) {
    <span style="color: #F92672;">return</span> &lt;&lt;<span style="color: #66D9EF;">heavy</span> <span style="color: #FD971F;">apple</span>?&gt;&gt;;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb31140d" class="outline-3">
<h3 id="orgb31140d">Main</h3>
<div class="outline-text-3" id="text-orgb31140d">
<div class="org-src-container">
<pre class="src src-java" id="org240fe2f"><span style="color: #F92672;">public</span> <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">main</span>(<span style="color: #66D9EF;">String</span> ... <span style="color: #FD971F;">args</span>) {

    &lt;&lt;inventory&gt;&gt;

    &lt;&lt;green apples by <span style="color: #66D9EF;">method</span> <span style="color: #FD971F;">reference</span>&gt;&gt;

    &lt;&lt;heavy apples by <span style="color: #66D9EF;">method</span> <span style="color: #FD971F;">reference</span>&gt;&gt;

    &lt;&lt;green apples <span style="color: #66D9EF;">via</span> <span style="color: #FD971F;">lambda</span>&gt;&gt;

    &lt;&lt;heavy apples <span style="color: #66D9EF;">via</span> <span style="color: #FD971F;">lambda</span>&gt;&gt;

    &lt;&lt;weird apples with overly <span style="color: #66D9EF;">complex</span> <span style="color: #FD971F;">lambda</span>&gt;&gt;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org508366c"><span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">inventory</span> = Arrays.asList(<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Apple</span>(80, <span style="color: #E6DB74;">"green"</span>),
                                      <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Apple</span>(155, <span style="color: #E6DB74;">"green"</span>),
                                      <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Apple</span>(120, <span style="color: #E6DB74;">"red"</span>));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org360b0d8">&lt;&lt;comment: just the green apples&gt;&gt;
<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; greenApples = filterApples(inventory, FilteringApples::isGreenApple);
System.out.println(greenApples);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org474a0b0">&lt;&lt;comment: just the heavy apples&gt;&gt;
<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; heavyApples = filterApples(inventory, FilteringApples::isHeavyApple);
System.out.println(heavyApples);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org5efd696">&lt;&lt;comment: just the green apples&gt;&gt;
<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; greenApples2 = filterApples(inventory, (Apple <span style="color: #66D9EF;">a</span>) -&gt; &lt;&lt;<span style="color: #66D9EF;">a</span> <span style="color: #FD971F;">green</span>?&gt;&gt;);
System.out.println(greenApples2);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org10435e6">&lt;&lt;comment: just the heavy apples&gt;&gt;
<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; heavyApples2 = filterApples(inventory, (Apple <span style="color: #66D9EF;">a</span>) -&gt; &lt;&lt;<span style="color: #66D9EF;">a</span> <span style="color: #FD971F;">heavy</span>?&gt;&gt;);
System.out.println(heavyApples2);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orge4db55d"><span style="color: #75715E;">// </span><span style="color: #75715E;">[]</span>
<span style="color: #66D9EF;">List</span>&lt;<span style="color: #66D9EF;">Apple</span>&gt; <span style="color: #FD971F;">weirdApples</span> = filterApples(inventory, (Apple <span style="color: #66D9EF;">a</span>) -&gt; &lt;&lt;<span style="color: #66D9EF;">a</span> <span style="color: #FD971F;">light</span>?&gt;&gt; ||
                                       &lt;&lt;<span style="color: #66D9EF;">a</span> <span style="color: #FD971F;">brown</span>?&gt;&gt;);
System.out.println(weirdApples);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orgfa9ac89">a.getWeight() &gt; 150
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orgc3f4224">a.getWeight() &lt; 80
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org8599d87"><span style="color: #E6DB74;">"green"</span>.equals(a.getColor())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="orgb0e56d6"><span style="color: #E6DB74;">"brown"</span>.equals(a.getColor())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org34fbe36"><span style="color: #75715E;">// </span><span style="color: #75715E;">[Apple{color='green', weight=80}, Apple{color='green', weight=155}]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java" id="org619946b"><span style="color: #75715E;">// </span><span style="color: #75715E;">[Apple{color='green', weight=155}]</span>
</pre>
</div>

<p>
Name the package <code>lambdasinaction.chap1</code>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="org17c012a"><span style="color: #F92672;">package</span> lambdasinaction.<span style="color: #AE81FF;">chap1</span>;
</pre>
</div>

<p>
Import <a href="https://docs.oracle.com/javase/8/docs/api/java/util/package-summary.html#package.description"><code>java.util.*</code></a> and <a href="https://docs.oracle.com/javase/8/docs/api/java/util/function/Predicate.html"><code>Predicate&lt;T&gt;</code></a>.
</p>
<div class="org-src-container">
<pre class="src src-java" id="orga09e2d1"><span style="color: #F92672;">import</span> <span style="color: #AE81FF;">java</span>.<span style="color: #AE81FF;">util</span>.*;
<span style="color: #F92672;">import</span> <span style="color: #AE81FF;">java</span>.<span style="color: #AE81FF;">util</span>.<span style="color: #AE81FF;">function</span>.<span style="color: #66D9EF;">Predicate</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Generated by <span class="author">Eric Bailey</span> on <span class="date">2017-01-09 Mon 04:49</span> using <span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</span>.
</div>
</body>
</html>
